#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.azure[0].azurerm_linux_virtual_machine.hnt_terraform_vm has been deleted
  - resource "azurerm_linux_virtual_machine" "hnt_terraform_vm" {
        id                                                     = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Compute/virtualMachines/fleet-server"
        name                                                   = "fleet-server"
        # (40 unchanged attributes hidden)

      - identity {
          - principal_id = "f3cc37c1-fff0-4f49-9deb-850d865b060a" -> null
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.azure[0].azurerm_network_interface.hnt_terraform_nic has been deleted
  - resource "azurerm_network_interface" "hnt_terraform_nic" {
      - id                             = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Network/networkInterfaces/hnt-rg-nic" -> null
        name                           = "hnt-rg-nic"
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.azure[0].azurerm_network_security_group.hnt_terraform_nsg has been deleted
  - resource "azurerm_network_security_group" "hnt_terraform_nsg" {
      - id                  = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Network/networkSecurityGroups/hnt-rg-nsg" -> null
        name                = "hnt-rg-nsg"
        # (3 unchanged attributes hidden)
    }

  # module.azure[0].azurerm_public_ip.hnt_terraform_public_ip has been deleted
  - resource "azurerm_public_ip" "hnt_terraform_public_ip" {
      - id                      = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Network/publicIPAddresses/hnt-rg-public-ip" -> null
      - ip_address              = "52.172.221.248" -> null
        name                    = "hnt-rg-public-ip"
        # (9 unchanged attributes hidden)
    }

  # module.azure[0].azurerm_resource_group.hnt_rg has been deleted
  - resource "azurerm_resource_group" "hnt_rg" {
        id         = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg"
      - location   = "centralindia" -> null
      - name       = "hnt-rg" -> null
        # (1 unchanged attribute hidden)
    }

  # module.azure[0].azurerm_storage_account.hnt_storage_acc has been deleted
  - resource "azurerm_storage_account" "hnt_storage_acc" {
      - id                                 = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Storage/storageAccounts/hacknocturne" -> null
        name                               = "hacknocturne"
        # (97 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.azure[0].azurerm_subnet.hnt_terraform_subnet has been deleted
  - resource "azurerm_subnet" "hnt_terraform_subnet" {
      - id                                            = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Network/virtualNetworks/hnt-rg-vnet/subnets/hnt-rg-subnet" -> null
        name                                          = "hnt-rg-subnet"
        # (7 unchanged attributes hidden)
    }

  # module.azure[0].azurerm_virtual_network.hnt_terraform_network has been deleted
  - resource "azurerm_virtual_network" "hnt_terraform_network" {
        id                             = "/subscriptions/54e87436-10a8-4d6e-9db2-4581729189b2/resourceGroups/hnt-rg/providers/Microsoft.Network/virtualNetworks/hnt-rg-vnet"
      - name                           = "hnt-rg-vnet" -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure[0].azurerm_linux_virtual_machine.hnt_terraform_vm will be created
  + resource "azurerm_linux_virtual_machine" "hnt_terraform_vm" {
      + admin_username                                         = "az-admin"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "hnt-prod-server"
      + disable_password_authentication                        = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "centralindia"
      + max_bid_price                                          = -1
      + name                                                   = "fleet-server"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "hnt-rg"
      + size                                                   = "Standard_B1ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = "hntOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "ubuntu-25_04"
          + publisher = "Canonical"
          + sku       = "minimal"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.azure[0].azurerm_network_interface.hnt_terraform_nic will be created
  + resource "azurerm_network_interface" "hnt_terraform_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "centralindia"
      + mac_address                    = (known after apply)
      + name                           = "hnt-rg-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "hnt-rg"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "hnt_nic_configuration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.azure[0].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.azure[0].azurerm_network_security_group.hnt_terraform_nsg will be created
  + resource "azurerm_network_security_group" "hnt_terraform_nsg" {
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "hnt-rg-nsg"
      + resource_group_name = "hnt-rg"
      + security_rule       = (sensitive value)
    }

  # module.azure[0].azurerm_public_ip.hnt_terraform_public_ip will be created
  + resource "azurerm_public_ip" "hnt_terraform_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralindia"
      + name                    = "hnt-rg-public-ip"
      + resource_group_name     = "hnt-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.azure[0].azurerm_resource_group.hnt_rg will be created
  + resource "azurerm_resource_group" "hnt_rg" {
      + id       = (known after apply)
      + location = "centralindia"
      + name     = "hnt-rg"
    }

  # module.azure[0].azurerm_role_assignment.opa_blob_reader will be created
  + resource "azurerm_role_assignment" "opa_blob_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.azure[0].azurerm_storage_account.hnt_storage_acc will be created
  + resource "azurerm_storage_account" "hnt_storage_acc" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "centralindia"
      + min_tls_version                    = "TLS1_2"
      + name                               = "hacknocturne"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "hnt-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.azure[0].azurerm_storage_container.hnt_storage_blob will be created
  + resource "azurerm_storage_container" "hnt_storage_blob" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "opa"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.azure[0].azurerm_subnet.hnt_terraform_subnet will be created
  + resource "azurerm_subnet" "hnt_terraform_subnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "hnt-rg-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "hnt-rg"
      + virtual_network_name                          = "hnt-rg-vnet"
    }

  # module.azure[0].azurerm_virtual_network.hnt_terraform_network will be created
  + resource "azurerm_virtual_network" "hnt_terraform_network" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "centralindia"
      + name                           = "hnt-rg-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "hnt-rg"
      + subnet                         = (known after apply)
    }

  # module.cloudflare.cloudflare_dns_record.api will be created
  + resource "cloudflare_dns_record" "api" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "api.hack-nocturne.in"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "69defe33500abb1980b89042369243d0"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ active_ipv4     = (sensitive value)

```

</details>

*Pusher: @Techzy-Programmer, Action: `pull_request`*